Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--geomoose_quickstart.tmx
Source language: en
Languages: ja

source: GeoMoose Quickstart
ja: GeoMooseクイックスタート

source: GeoMoose is a browser based mapping framework for displaying distributed cartographic data. It is particularly useful for managing spatial and non-spatial data within county, city and municipal offices (from which GeoMoose originated).
ja: GeoMooseは、分散型地図データを表示するためのブラウザベースのマッピングフレームワークです。これは、郡、市、市のオフィス(GeoMooseの起源)内の空間データと非空間データの管理に特に便利です。

source: GeoMoose is a GIS data portal management framework. The installed version of GeoMoose on the Live DVD is an example configuration that displays an example set of layers.
ja: GeoMooseはGISデータポータル管理フレームワークです。Live DVDにインストールされているGeoMooseのバージョンは、レイヤのサンプルセットを表示する設定例です。

source: Start GeoMoose
ja: GeoMooseを開始

source: Go to the "Browser Clients" folder on the desktop.
ja: デスクトップ上の"Browser Clients"フォルダに移動します。

source: Click on the desktop icon "Start GeoMoose". This will launch the default browser which will navigate to the correct location automatically.
ja: デスクトップアイコン"Start GeoMoose"をクリックします。これにより既定のブラウザが起動し、自動的に正しい場所に移動します。

source: You will be presented with a web page displaying a demo interface of a GeoMoose instance.
ja: Webページが表示され、GeoMooseインスタンスのデモインターフェイスが表示されます。

source: The Interfaces presented above shows:
ja: 上記のインターフェイスは次のものを示しています。

source: A banner bar
ja: バナーバー

source: A tool bar
ja: ツールバー

source: A map window with navigation and zoom controls
ja: ナビゲーションとズームコントロールを備えたマップウィンドウ

source: A side menu with:
ja: サイドメニュー:

source: A "Jump to" location pull down list
ja: "Jump to"の場所のプルダウンリスト

source: Control tabs starting with "Catalog", for displaying the layer list. As needed, additional tabs will appear: an "Information" readout, a "Custom" output tab, and others.
ja: "Catalog"で始まるコントロールタブで、レイヤ一覧を表示します。必要に応じて、追加のタブが表示されます:"Information"の読み出し、"Custom"の出力タブなどです。

source: A Footer bar with:
ja: フッタバー:

source: Multiple coordinate readouts, one each for: X,Y (local dataset coordinates), LAT/LON (Decimal) and United States National Grid (USNG)
ja: 複数の座標表示:X、Y(データセットのローカル座標)、LAT/LON(10進数)、United States National Grid(USNG)

source: An editable pull down list for a view scales to choose from or define.
ja: 選択または定義するビュースケールの編集可能なプルダウンリスト。

source: Identify a location
ja: ロケーションを識別

source: Click on the "identify" ("i" in a circle icon) button in the top toolbar
ja: 上部ツールバーの"identify"(円形アイコンの中の"i")ボタンをクリック

source: Click a point on the map.
ja: マップ上の点をクリックしてください。

source: The catalog along the left side of the Map view will change to the "Super Tab" - a place to where GeoMoose displays results of an action or asks for more information. In this case, it will show the results of a query of each active and identifiable layer for the point that you clicked in the map.
ja: マップビューの左側に表示されるカタログが「Super Tab」に変わります。GeoMooseがアクションの結果を表示したり、詳細情報を要求したりする場所です。この場合、レイヤ内でクリックしたポイントについて、有効で識別可能な各マップのクエリー結果が表示されます。

source: Use the measuring tool
ja: 測定ツールを使用

source: The GeoMoose measure tool allows you to: * measure a point (return the coordinates of a picked point) * measure the distance along a potentially multi-segment line * measure the area of a polygon.
ja: GeoMooseの計測ツールを使用すると、次のことができます。*点を計測(選択された点の座標を返す)*複数の区間を含む可能性のある線に沿った距離を計測*ポリゴンの面積を計測

source: Click the double ended arrow icon in the top toolbar to start the measuring tool.
ja: 上部ツールバーの両端の矢印アイコンをクリックして、測定ツールを起動します。

source: Choose to measure a point, line, or polygon.
ja: ポイント、ライン、ポリゴンの計測を選択します。

source: Click on the map where you want to measure. To measure a point, just click the point on the map you want to measure. To measure a line or polygon click on the map for each vertex a of the line/polygon.
ja: 測定するマップ上でクリックします。点を計測するには、マップ上で計測する点をクリックします。ラインまたはポリゴンを計測するには、ライン/ポリゴンの各頂点aのマップ上でクリックします。

source: Double click to end the line/polygon.
ja: ダブルクリックしてライン/ポリゴンを終了します。

source: you can also measure a pre-existing feature on the map (if it is from a vector layer, including previous query results) without having to manually trace over it.
ja: 手動でトレースすることなく、マップ上の既存の地物を計測することもできます(ベクタレイヤからのものであれば、前のクエリー結果を含めて)。

source: Select features
ja: 地物を選択

source: You can select features from a Point, Line, Polygon, or from an existing feature. To start, click on the "Select Features" icon (mouse cursor icon), pick point, line, polygon and start drawing your selection in the map. You can double click the last point to finish the drawing process. If you want to adjust your selection you can do that with the "Modify Feature" option.
ja: 地物はポイント、ライン、ポリゴン、または既存の地物から選択できます。開始するには、「Select Features」アイコン(マウスカーソルアイコン)をクリックし、ポイント、ライン、ポリゴンを選択して、マップで選択の描画を開始します。最後の点をダブルクリックすると、描画プロセスを終了できます。選択を調整する場合は、[地物の変更]オプションを使用します。

source: You also have the option to select features based on a buffered version of what you drew. The default is to buffer by "0" which does nothing. Positive values expand what you drew by that distance, negative values shrink your drawing.
ja: 描画したもののバッファバージョンに基づいてフィーチャを選択するオプションもあります。既定値は"0"でバッファリングされ、何も行われません。正の値を指定すると、その距離で描いたものが拡大され、負の値を指定すると縮小されます。

source: Select which layer you want to select features from using the "Query Layer" select-box. Note: not all layers can be used with the Select Features tool. To be available for selection, a layer needs to be a vector layer and be configured for selection in the mapbook.
ja: 「クエリーレイヤ」選択ボックスを使用して、地物を選択するレイヤを選択します。注: 地物を選択ツールで使用できないレイヤもあります。選択可能にするには、レイヤがベクタレイヤであり、マップブックで選択するように設定されている必要があります。

source: Finally, click the "Go" button to actually select the features. GeoMoose will return a summary of what was selected in the Super Tab as well, highlight the selected features on the map, and show an attribute table of the selected features.
ja: 最後に、[Go]ボタンをクリックして、地物を実際に選択します。GeoMooseは、スーパータブで選択されたものの概要も返し、マップ上で選択されたフィーチャを強調表示し、選択されたフィーチャの属性テーブルを表示します。

source: If you hover over a line in the table, the corresponding feature on the map will be highlighted. Additionally, you can use the funnel icons in the table header to further filter results, and use the triangle icons in the table header to sort results. The results can be downloaded as a CSV file using the download icon to the top and left of the table.
ja: テーブルの上にカーソルを置くと、対応する地物が強調表示されます。さらに、テーブルヘッダーのファンネルアイコンを使用して結果をさらにフィルタしたり、テーブルヘッダーの三角形アイコンを使用して結果を並べ替えたりできます。結果は、テーブルの左上にあるダウンロードアイコンを使用してCSVファイルとしてダウンロードできます。

source: Search for features
ja: 地物を検索

source: You can also search for features by attribute. To start, hover over the "Search" menu in the toolbar and then click on the "Search Parcels" icon. Enter your search parameters in the Super Tab then click the "Go!" button.
ja: 地物を属性で検索することもできます。開始するには、ツールバーの"検索"メニューにカーソルを置き、"区画検索"アイコンをクリックします。Super Tabに検索パラメータを入力し、[Go!]ボタンをクリックします。

source: The following screenshot demonstrates a search of all parcel owners containing the name "frank".
ja: 次のスクリーンショットは、「frank」という名前を含むすべての区画所有者の検索を示しています。

source: Three results appear in the list and are highlighted on the map.
ja: 3つの結果が一覧に表示され、マップ上で強調表示されます。

source: Clicking the magnifying glass icon/parcel number will zoom you to the specific parcel as illustrated in the following screenshot.
ja: 虫眼鏡アイコン/区画番号をクリックすると、次のスクリーンショットに示すように、特定の区画にズームします。

source: Print the map
ja: マップを印刷

source: This next screenshot shows how the Print tool looks as provided with demo for GeoMoose. When you click on the Print tool, a dialog appears which asks for a title for the printed map, the page size and rotation, printed resolution, and shows a preview of what will be printed.
ja: 次のスクリーンショットは、GeoMooseのデモで提供されている印刷ツールの外観を示しています。印刷ツールをクリックすると、ダイアログが表示され、印刷されるマップのタイトル、ページサイズと回転、印刷解像度、印刷内容のプレビューが表示されます。

source: Clicking the Print button in the dialog will generate a PDF printout that you can open or save.
ja: ダイアログの[印刷]ボタンをクリックすると、PDFの印刷出力が生成され、開いたり保存したりできます。

source: What next?
ja: 次のステップ

source: This is only the first step on the road to using GeoMoose. There is a lot more functionality you can try.
ja: これは、GeoMooseを使用するための最初のステップにすぎません。他にも多くの機能を試すことができます。

source: GeoMoose Project home
ja: GeoMooseプロジェクトのホーム

source: GeoMoose Tutorial
ja: GeoMooseのチュートリアル
